Rhino.Geometry.Rectangle3d.Corner(System.Int32)
Gets the corner at the given index.
index:
Index of corner, valid values are:
0 = lower left (min-x, min-y)1 = lower right (max-x, min-y)2 = upper right (max-x, max-y)3 = upper left (min-x, max-y)
Returns: The point at the given corner index.

Rhino.Geometry.Rectangle3d.RecenterPlane(System.Int32)
Recenters the base plane on one of the corners.
index:
Index of corner, valid values are:
0 = lower left (min-x, min-y)1 = lower right (max-x, min-y)2 = upper right (max-x, max-y)3 = upper left (min-x, max-y)