Rhino.RhinoMath.IsValidDouble(System.Double)
Determines whether a System.Double value is valid within the RhinoCommon context.
Rhino does not use Double.NaN by convention, so this test evaluates to true if:x is not equal to RhinoMath.UnsetValueSystem.Double.IsNaN(x) evaluates to falseSystem.Double.IsInfinity(x) evaluates to false
x:
System.Double number to test for validity.
Returns: true if the number if valid, false if the number is NaN, Infinity or Unset.

Rhino.RhinoMath.IsValidSingle(System.Single)
Determines whether a System.Single value is valid within the RhinoCommon context.
Rhino does not use Single.NaN by convention, so this test evaluates to true if:x is not equal to RhinoMath.UnsetValue,System.Single.IsNaN(x) evaluates to falseSystem.Single.IsInfinity(x) evaluates to false
x:
System.Single number to test for validity.
Returns: true if the number if valid, false if the number is NaN, Infinity or Unset.