Rhino.Input.Custom.GetPoint.Get(System.Boolean)
After setting up options and so on, call this method to get a 3d point.
onMouseUp:
If false, the point is returned when the left mouse button goes down.
If true, the point is returned when the left mouse button goes up.
Returns:
Rhino.Input.GetResult.Point if the user chose a point; other enumeration value otherwise.