Rhino.UnitSystem.Lightyears
Light Year
http://en.wikipedia.org/wiki/Light_year
9.46073e+15 meters   http://units.nist.gov/Pubs/SP811/appenB9.htm A light year is the distance light travels in one Julian year.
The speed of light is exactly 299792458 meters/second.
A Julian year is exactly 365.25 * 86400 seconds and is
approximately the time it takes for one earth orbit.