Rhino.Geometry.Unroller.AbsoluteTolerance
Gets or sets the absolute tolerance for the unrolling operation.
Absolute tolerance is used in the evaluation of new entities,
such as intersections, reprojections and splits.In the current implementation, absolute tolerance is used
in tessellating rails, fitting curves and pulling back trims.

Rhino.Geometry.Unroller.RelativeTolerance
Gets or sets the relative tolerance for the unrolling operation.
Relative tolerance is used in the evaluation of intrinsic properties,
such as computations "along" the surface or brep.In the current implementation, relative tolerance is used to decide
if a surface is flat enough to try to unroll. That helps ease the scale dependency.
The surface has to be linear in one direction within (length * RelativeTolerance)
to be considered linear for that purpose. Otherwise smash will ignore that tolerance and
unroll anything.