Rhino.Geometry.Curve.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.Curve.ClosestPoint(Rhino.Geometry.Point3d,System.Double@,System.Double)
Finds the parameter of the point on a curve that is closest to testPoint.
If the maximumDistance parameter is > 0, then only points whose distance
to the given point is <= maximumDistance will be returned.  Using a
positive value of maximumDistance can substantially speed up the search.
testPoint: Point to project.
t: parameter of local closest point returned here.
maximumDistance: The maximum allowed distance.
Past this distance, the search is given up and false is returned.Use 0 to turn off this parameter.
Returns: true on success, false on failure.

Rhino.Geometry.Curve.Fair(System.Double,System.Double,System.Int32,System.Int32,System.Int32)
Fairs a curve object. Fair works best on degree 3 (cubic) curves. Attempts to
remove large curvature variations while limiting the geometry changes to be no
more than the specified tolerance.
distanceTolerance: Maximum allowed distance the faired curve is allowed to deviate from the input.
angleTolerance: (in radians) kinks with angles <= angleTolerance are smoothed out 0.05 is a good default.
clampStart: The number of (control vertices-1) to preserve at start.
0 = preserve start point1 = preserve start point and 1st derivative2 = preserve start point, 1st and 2nd derivative
clampEnd: Same as clampStart.
iterations: The number of iteratoins to use in adjusting the curve.
Returns: Returns new faired Curve on success, null on failure.

Rhino.Geometry.Curve.Fit(System.Int32,System.Double,System.Double)
Fits a new curve through an existing curve.
degree: The degree of the returned Curve. Must be bigger than 1.
fitTolerance: The fitting tolerance. If fitTolerance is RhinoMath.UnsetValue or <=0.0,
the document absolute tolerance is used.
angleTolerance: The kink smoothing tolerance in radians.
If angleTolerance is 0.0, all kinks are smoothedIf angleTolerance is >0.0, kinks smaller than angleTolerance are smoothedIf angleTolerance is RhinoMath.UnsetValue or <0.0, the document angle tolerance is used for the kink smoothing
Returns: Returns a new fitted Curve if successful, null on failure.