Rhino.Geometry.Interval.FromUnion(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Returns a new Interval which contains both inputs.
a: The first input interval.
b: The second input interval.
Returns: The union of an empty set and an increasing interval is the increasing interval.
The union of two empty sets is empty.The union of an empty set an a non-empty interval is the non-empty interval.The union of two non-empty intervals is [min(a.Min(),b.Min()), max(a.Max(),b.Max())]