Rhino.DocObjects.ConstructionPlane.ThickLineFrequency
Gets or sets the recurrence of a wider line on the grid.
0: No lines are thick, all are drawn thin.1: All lines are thick.2: Every other line is thick.3: One line in three lines is thick (and two are thin).4: ...

Rhino.DocObjects.ConstructionPlane.DepthBuffered
Gets or sets whether the grid is drawn on top of geometry.
false=grid is always drawn behind 3d geometrytrue=grid is drawn at its depth as a 3d plane and grid lines obscure things behind the grid.