Rhino.DocObjects.Custom.UserData.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.