Rhino.DocObjects.Layer.GetDefaultLayerProperties
Constructs a layer with the current default properties.
The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColorline style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStylematerial index = -1iges level = -1mode = NormalLayername = emptylayer index = 0 (ignored by AddLayer)
Returns: A new layer instance.