Rhino.Geometry.Vector3d.CrossProduct(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
a: First vector.
b: Second vector.
Returns: A new vector that is perpendicular to both a and b,
has Length == a.Length * b.Length andwith a result that is oriented following the right hand rule.

Rhino.Geometry.Vector3d.Item(System.Int32)
Gets or sets a vector component at the given index.
index: Index of vector component. Valid values are:
0 = X-component1 = Y-component2 = Z-component
.

Rhino.Geometry.Vector3d.Transform(Rhino.Geometry.Transform)
Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,result = transformation*vector
transformation: Transformation matrix to apply.

Rhino.Geometry.Vector3d.IsParallelTo(Rhino.Geometry.Vector3d)
Determines whether this vector is parallel to another vector, within one degree (within Pi / 180).
other: Vector to use for comparison.
Returns:
Parallel indicator:
+1 = both vectors are parallel 0 = vectors are not parallel, or at least one of the vectors is zero-1 = vectors are anti-parallel.

Rhino.Geometry.Vector3d.IsParallelTo(Rhino.Geometry.Vector3d,System.Double)
Determines whether this vector is parallel to another vector, within a provided tolerance.
other: Vector to use for comparison.
angleTolerance: Angle tolerance (in radians).
Returns:
Parallel indicator:
+1 = both vectors are parallel.0 = vectors are not parallel or at least one of the vectors is zero.-1 = vectors are anti-parallel.