Rhino.Geometry.BrepFace.TrimAwareIsoIntervals(System.Int32,System.Double)
Gets intervals where the iso curve exists on a BrepFace (trimmed surface)
direction: Direction of isocurve.
0 = Isocurve connects all points with a constant U value.1 = Isocurve connects all points with a constant V value.
constantParameter: Surface parameter that remains identical along the isocurves.
Returns:
If direction = 0, the parameter space iso interval connects the 2d points
(intervals[i][0],iso_constant) and (intervals[i][1],iso_constant).
If direction = 1, the parameter space iso interval connects the 2d points
(iso_constant,intervals[i][0]) and (iso_constant,intervals[i][1]).

Rhino.Geometry.BrepFace.TrimAwareIsoCurve(System.Int32,System.Double)
Similar to IsoCurve function, except this function pays attention to trims on faces
and may return multiple curves.
direction: Direction of isocurve.
0 = Isocurve connects all points with a constant U value.1 = Isocurve connects all points with a constant V value.
constantParameter: Surface parameter that remains identical along the isocurves.
Returns: Isoparametric curves connecting all points with the constantParameter value.
Remarks:
In this function "direction" indicates which direction the resulting curve runs.
0: horizontal, 1: vertical
In the other Surface functions that take a "direction" argument,
"direction" indicates if "constantParameter" is a "u" or "v" parameter.