Rhino.Geometry.Quaternion
Represents the four coefficient values in a quaternion.
The first value a is the real part,
while the rest multipies i, j and k, that are imaginary.quaternion = a + bi + cj + dk

Rhino.Geometry.Quaternion.Invert
Modifies this quaternion to become
(a/L2, -b/L2, -c/L2, -d/L2),where L2 = length squared = (a*a + b*b + c*c + d*d).This is the multiplicative inverse, i.e.,
(a,b,c,d)*(a/L2, -b/L2, -c/L2, -d/L2) = (1,0,0,0).
Returns:
true if successful. false if the quaternion is zero and cannot be inverted.

Rhino.Geometry.Quaternion.Inverse
Computes a new inverted quaternion,
(a/L2, -b/L2, -c/L2, -d/L2),where L2 = length squared = (a*a + b*b + c*c + d*d).
This is the multiplicative inverse, i.e.,
(a,b,c,d)*(a/L2, -b/L2, -c/L2, -d/L2) = (1,0,0,0).
If this is the zero quaternion, then the zero quaternion is returned.

Rhino.Geometry.Quaternion.CrossProduct(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Computes the vector cross product of p and q = (0,x,y,z),
where (x,y,z) = CrossProduct(p.Vector,q.Vector).This is not the same as the quaternion product p*q.
p: A quaternion.
q: Another quaternion.
Returns: A new quaternion.