Rhino.Geometry.Intersect.Intersection.LineLine(Rhino.Geometry.Line,Rhino.Geometry.Line,System.Double@,System.Double@)
Finds the closest point between two infinite lines.
lineA: First line.
lineB: Second line.
a:
Parameter on lineA that is closest to lineB.
The shortest distance between the lines is the chord from lineA.PointAt(a) to lineB.PointAt(b)
b:
Parameter on lineB that is closest to lineA.
The shortest distance between the lines is the chord from lineA.PointAt(a) to lineB.PointAt(b)
Returns:
true if points are found and false if the lines are numerically parallel.
Numerically parallel means the 2x2 matrix:
+AoA  -AoB-AoB  +BoB
is numerically singular, where A = (lineA.To - lineA.From) and B = (lineB.To-lineB.From)