Rhino.Geometry.Collections.MeshVertexColorList.SetColor(System.Int32,System.Int32,System.Int32,System.Int32)
Sets or adds a vertex color to the color List.
If [index] is less than [Count], the existing vertex at [index] will be modified.If [index] equals [Count], a new vertex is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex color to set.
If index equals Count, then the color will be appended.
red: Red component of vertex color. Value must be in the 0~255 range.
green: Green component of vertex color. Value must be in the 0~255 range.
blue: Blue component of vertex color. Value must be in the 0~255 range.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexColorList.SetColor(System.Int32,System.Drawing.Color)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.If [index] equals [Count], a new vertex is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex color to set.
If index equals Count, then the color will be appended.
color: Color to set, Alpha channels will be ignored.
Returns: true on success, false on failure.