Rhino.Input.RhinoGet.GetBool(System.String,System.Boolean,System.String,System.String,System.Boolean@)
Easy to use bool getter.
prompt: Command prompt.
acceptNothing: If true, the user can press enter.
offPrompt: The 'false/off' message.
onPrompt: The 'true/on' message.
boolValue: Default bool value set to this and returned here.
Returns: The getter result based on user choice.
Commands.Result.Success - got value.Commands.Result.Nothing - user pressed enter.Commands.Result.Cancel - user cancelled value getting.