Rhino.DocObjects.ObjectAttributes.LinetypeIndex
Gets or sets the linetype index.
Linetype definitions in an OpenNURBS model are stored in a linetype table.
The linetype table is conceptually an array of ON_Linetype classes. Every
OpenNURBS object in a model references some linetype.  The object's linetype
is specified by zero based indicies into the ON_Linetype array.Index 0 is reserved for continuous linetype (no pattern).