Rhino.Geometry.Collections.MeshFaceList.GetFaceCenter(System.Int32)
Gets the center point of a face.
For a triangular face, this is considered the centroid or barycenter.For a quad, this is considered the bimedians intersection
(the avarage of four points).
faceIndex: A face index.
Returns: The center point.

Rhino.Geometry.Collections.MeshFaceList.CullDegenerateFaces
Attempts to removes degenerate faces from the mesh.
Degenerate faces are faces that contains such a combination of indices,
that their final shape collapsed in a line or point.Before returning, this method also attempts to repair faces by juggling
vertex indices.
Returns: The number of degenerate faces that were removed.