Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Line,Rhino.Geometry.Line,System.Double,System.Double)
Constructs a new surface of revolution from a generatrix line and an axis.
This overload accepts a slice start and end angles.Results can be (truncated) cones, cylinders and circular hyperboloids, or can fail.
revoluteLine: A generatrix.
axisOfRevolution: An axis.
startAngleRadians: An angle in radias for the start.
endAngleRadians: An angle in radias for the end.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.