Rhino.Geometry.Arc
Represents the value of a plane, two angles and a radius in
a subcurve of a three-dimensional circle.
The curve is parameterized by an angle expressed in radians. For an IsValid arc
the total subtended angle AngleRadians() = Domain()(1) - Domain()(0) must satisfy
0 < AngleRadians() < 2*PiThe parameterization of the Arc is inherited from the Circle it is derived from.
In particulart -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxiswhere xaxis and yaxis, (part of Circle.Plane) form an othonormal frame of the plane
containing the circle.