Rhino.Display.DisplayPipeline
The display pipeline calls events during specific phases of drawing
During the drawing of a single frame the events are called in the following order.
[Begin Drawing of a Frame]
CalculateBoundingBoxCalculateClippingPanesSetupFrustumSetupLightingInitializeFrameBufferDrawBackgroundIf this is a layout and detail objects exist the channels are called in the
same order for each detail object (drawn as a nested viewport)PreDrawObjectsFor Each Visible Non Highlighted ObjectSetupObjectDisplayAttributesPreDrawObjectDrawObjectPostDrawObjectPostDrawObjects - depth writing/testing onDrawForeGround - depth writing/testing offFor Each Visible Highlighted ObjectSetupObjectDisplayAttributesPreDrawObjectDrawObjectPostDrawObjectPostProcessFrameBuffer (If a delegate exists that requires this)DrawOverlay (if Rhino is in a feedback mode)
[End of Drawing of a Frame]
NOTE: There may be multiple DrawObject calls for a single object. An example of when this could
happen would be with a shaded sphere. The shaded mesh is first drawn and these channels would
be processed; then at a later time the isocurves for the sphere would be drawn.

Rhino.Display.DisplayPipeline.StereoProjection
Gets the current stereo projection if stereo mode is on.
0 = left1 = right
If stereo mode is not enables, this property always returns 0.

Rhino.Display.DisplayPipeline.NestLevel
Gets the current nested viewport drawing level.
This is used to know if you are currently inside the drawing of a nested viewport (detail object in Rhino).
Nest level = 0 Drawing is occuring in a standard Rhino viewport or on the page viewport.Nest level = 1 Drawing is occuring inside a detail view object.

Rhino.Display.DisplayPipeline.DrawBrepWires(Rhino.Geometry.Brep,System.Drawing.Color,System.Int32)
Draws all the wireframe curves of a brep object.
brep: Brep to draw.
color: Color of Wireframe curves.
wireDensity:
"Density" of wireframe curves.
-1 = no internal wires. 0 = default internal wires.>0 = custom high density.