Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Boolean})
Sets a list, an array or any enumerable of System.Boolean.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Byte})
Sets a list, an array or any enumerable of System.Byte.
key: A text key.
val: A value for that key
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.SByte})
Sets a list, an array or any enumerable of System.SByte.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Int16})
Sets a list, an array or any enumerable of System.Int16.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Int32})
Sets a list, an array or any enumerable of System.Int32.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Single})
Sets a list, an array or any enumerable of System.Single.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Double})
Sets a list, an array or any enumerable of System.Double.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.Guid})
Sets a list, an array or any enumerable of System.Guid.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{System.String})
Sets a list, an array or any enumerable of System.String.
key: A text key.
val: A value for that key.
Because this interface is a reference type, changes to the assigned object will modify this entry inside the dictionary.It is up to the user to clone this entry when appropriate.
Returns: true if set operation succeeded, otherwise false.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Collections.ArchivableDictionary)
Sets another Rhino.Collections.ArchivableDictionary as entry in this dictionary.
key: A text key.
val: An object for that key.
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.It is up to the user to clone this entry when appropriate.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.MeshingParameters)
Sets a Rhino.Geometry.MeshingParameters.
key: A text key.
val: An object for that key.
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.It is up to the user to clone this entry when appropriate.

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.GeometryBase)
Sets any class deriving from the Rhino.Geometry.GeometryBase base class.
key: A text key.
val: A geometry object for that key.
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.It is up to the user to clone this entry when appropriate. You can use Rhino.Geometry.GeometryBase.Duplicate for this.