Rhino.Geometry.AnnotationBase.NumericValue
Gets the numeric value, depending on geometry type.
LinearDimension: distance between arrow tipsRadialDimension: radius or diamater depending on typeAngularDimension: angle in degreesLeader or Text: UnsetValue