Rhino.Geometry.Vector3f.Transform(Rhino.Geometry.Transform)
Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,result = transformation*vector
transformation: Transformation matrix to apply.

Rhino.Geometry.Vector3f.CrossProduct(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
a: First vector.
b: Second vector.
Returns: A new vector that is perpendicular to both a and b,
has Length == a.Length * b.Length andwith a result that is oriented following the right hand rule.