Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,System.Single,System.Single,System.Single)
Sets or adds a normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.If [index] equals [Count], a new vertex normal is appended to the end of the list.If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
x: X component of vertex normal.
y: Y component of vertex normal.
z: Z component of vertex normal.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,System.Double,System.Double,System.Double)
Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.If [index] equals [Count], a new vertex normal is appended to the end of the list.If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
x: X component of vertex normal.
y: Y component of vertex normal.
z: Z component of vertex normal.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,Rhino.Geometry.Vector3f)
Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.If [index] equals [Count], a new vertex normal is appended to the end of the vertex list.If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
normal: The new normal at the index.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,Rhino.Geometry.Vector3d)
Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.If [index] equals [Count], a new vertex normal is appended to the end of the list.If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
normal: The new normal at the index.
Returns: true on success, false on failure.